---
kind: method
id: M:Autodesk.Revit.DB.GlobalParameter.CanChangeReporting
source: html/4cb16ada-5e43-4307-3886-61a868c8a0dc.htm
---
# Autodesk.Revit.DB.GlobalParameter.CanChangeReporting Method

Tests whether the global parameter permits a change of its current value of the IsReporting attribute.

## Syntax (C#)
```csharp
public bool CanChangeReporting()
```

## Returns
Returns True if the change is allowed; False otherwise.